Метасимволи (шаблони), які відповідають одному символу:
[]	Визначає набір символів, з яких може бути вибрано один	
    [abc]
    "a", "b", "c"
[^]	Визначає набір символів, які не повинні бути вибрані	
    [^abc]
    "d", "e", "f"
.	Відповідає будь-якому символу, крім символу нового рядка	
    a.b
    "axb", "a1b", "a b"
\d	Відповідає будь-якій цифрі (еквівалентно [0-9])	
    \d\d
    "12", "34", "99"
\D	Відповідає будь-якому символу, крім цифри (еквівалентно [^0-9])	
    \D\D
    "ab", "&%", "!@"
\w	Відповідає будь-якій букві, цифрі або символу підкреслення (еквівалентно [a-zA-Z0-9_])	
    \w\w
    "ab", "12", "a_"
\W	Відповідає будь-якому символу, крім букви, цифри або символу підкреслення (еквівалентно [^a-zA-Z0-9_])	
    \W\W
    "&%", "!@", " *"
\s	Відповідає будь-якому пробільному символу (пробіл, табуляція, символ нового рядка тощо)	
    \s\s
    " ", "\t\t", "\n\n"
\S	Відповідає будь-якому непробільному символу (еквівалентно [^\s])	
    \S\S
    "ab", "12", "!@"
\b	Відповідає межі слова (місце, де зустрічаються символ слова та несимвол слова)	
\B	Відповідає місцю, де немає межі слова	\Bword\B	"sword" (відповідає "word" всередині слова)
