'''
З однієї функції можна викликати іншу.
Спробуйте написати програму по слідуючому опису.
Основна гілка програми, не враховуючи оголошень усіх функцій,
складається з одного рядка початкового кода.
Це виклик функції test().
В функції test() є запит на ввід цілого числа.
Якщо користувач вводить додатне число, то викликається функція positive(),
інакше викликається функція negative().
Функція positive() просто виводить "Додатне",
функція negative() виводить "Від'ємне".
Зрозуміло, що виклик test() має слідувати після визначення цієї функції.
Однак чи має значення порядок визначення самих функцій?
Тобто чи повинні визначення positive() і negative() передкувати визначенню test()?
Перевірте вашу гіпотезу, помінявши визначення функцій місцями.
Спробуйте пояснити результат.
'''
def negative():
	print('Negative')
		
def positive():
	print('Positive')
	
def test():
	n = int(input('Enter some integer: '))
	if n > 0:
		positive()
	else:
		negative()

test()
