Квантифікатори — вказують на кількість повторів:
*	Відповідає попередньому виразу нуль або більше разів
    a*b
    "b", "ab", "aab", "aaab"
+	Відповідає попередньому виразу один або більше разів
    a+b
    "ab", "aab", "aaab"
?	Відповідає попередньому виразу нуль або один раз
    a?b
    "b", "ab"
{n}	Відповідає попередньому виразу точно n разів
    a{3}b
    "aaab"
{n,}	Відповідає попередньому виразу n або більше разів
    a{2,}b
    "aab", "aaab", "aaaab"
{n,m}	Відповідає попередньому виразу від n до m разів
    a{1,3}b
    "ab", "aab", "aaab"
{,m}	Відповідає попередньому виразу нуль або більше разів, але не більше ніж m разів
    a{,3}b
    "b", "ab", "aab", "aaab"
