'''
"Матриця"

Реалізуйте функцію print_matrix().
Функція отримує матрицю чисел — список, елементами якого є списки (рядки), елементами яких у свою чергу є цілі числа (колонки).
Функція виводить матрицю у вигляді таблиці.
Якщо функції передано матрицю
[[1,2,3],[4,5,6],[7,8,9]]
то вивід має бути наступним:
1 2 3
4 5 6
7 8 9
'''
def print_matrix(matrix):
	# ваш код тут

matrix = [[1,2,3],[4,5,6],[7,8,9]]
# випадково сгенерована матриця, можна розкоментувати наступний код
'''
from random import randint
n = randint(3, 6)
matrix = [[randint(0, 9) for col in range(n)] for row in range(n)]
'''
print_matrix(matrix)