'''
"Купи слона!"

Написати програму яка виконує наступне:
1. Виводить повідомлення: "Купи слона?"
2. Отримати від користувача символьний рядок
2. Якщо користувач ввів слово "куплю", то програма виводить "Гаразд!" і припиняє роботу
3. В іншому випадку виводить повідомлення: 'Усі кажуть "те, що ввів користувач"... А ти купи слона?' і переходить до пункту 2

Ось приклад роботи програми:
Купи слона? ні
Усі кажуть "ні"... А ти купи слона? не хочу
Усі кажуть "не хочу"... А ти купи слона? відчепись
Усі кажуть "відчепись"... А ти купи слона? куплю
Гаразд!
>>>
'''
answer = input('Купи слона? ')
while answer != 'куплю':
    answer = input(f'Усі кажуть "{answer}"... А ти купи слона? ')
print('Гаразд!')
