COLUMNS = 'abcdefgh'
ROWS = '12345678'

def is_cell_valid(cell):
	if len(cell) != 2:
		return False
	return cell[0].lower() in COLUMNS and \
		cell[1].lower() in ROWS

def get_user_input():
	while True:
		cell = input('Введіть номер клітинки: ')
		if is_cell_valid(cell):
			return cell
		print('Неправильний ввід')
	
def get_cell_color(cell):
	assert is_cell_valid(cell), f'Incorrect cell: {cell}'
	x = COLUMNS.index(cell[0].lower())
	y = ROWS.index(cell[1].lower())
	return 'чорний' if (x + y) % 2 == 0 else 'білий'

cell = get_user_input()
color = get_cell_color(cell)
print(f'Колір клітинки {cell}: {color}')


'''
"Шахівниця"

Завдання на залік. Виконати до 28 червня включно.
Спроектуйте програму, використовуйте декомпозицію — розбивайте задачу на підзадачі.
Прокоментуйте код якщо необхідно, можна українською або іншою зрозумілою більшості мовою.
Створіть тести якщо необхідно.

Шахівниця складається з 8 на 8 клітинок.
Кожна клітинка має назву, 
що відповідає рядку і стовпчику, 
у якому вона перебуває. 
Горизонталі (рядки) пронумеровано від 1 до 8, 
починаючи з боку гравця. 
Вертикалі (стовпчики) позначено літерами латинської абетки 
від "a" до "h" 
у напрямку зліва праворуч з боку гравця. 
У такій системі назва клітинки складається з літери, 
за якою вказують цифру. 
Таким чином клітинка у нижньому лівому куті дошки 
має назву "a1".
Клітинка "a1" чорного кольору.

Написати програму яка виконує наступне:
1. Просить користувача ввести номер клітинки.
Користувач може використовувати як великі латинські букви (B2) 
так і маленькі (b2).
2. Якщо користувач ввів дані які не відповідають правилам запису номера клітинки,
програма виводить відповідне повідомлення і переходимо до пункту 1.
3. Інакше програма визначає колір клітинки за введеним користувачем номером і повідолляє. користувача про колір клітинки.
'''
