'''
"Купи слона!"

Написати програму яка виконує наступне:
1. Виводить повідомлення: "Купи слона?"
2. Отримати від користувача символьний рядок
2. Якщо користувач ввів слово "куплю", то програма виводить "Гаразд!" і припиняє роботу
3. В іншому випадку виводить повідомлення: 'Усі кажуть "те, що ввів користувач"... А ти купи слона?' і переходить до пункту 2
'''
answer = input('Купи слона?')
while answer != 'куплю':
	answer = input('Усі кажуть "' + answer + '"... А ти купи слона?')
print('Гаразд!')
