Перерахування пар ключ-значення:  

	:::python
	>>> d = {'John': 22, 'Jane': 18}
	>>> d
	{'John': 22, 'Jane': 18}
	>>>
	
Словникові включення (вирази):

people = ['John', 'Jane', 'Mary', 'Bob', 'Alice']
d = {key:value for key, value in enumerate(people, start=1)}
	
1. Використовуючи конструктор класа:
	
dict(**kwargs)
d=dict(john=22, jane=18)
	
dict(mapping, **kwargs)
d = dict({'key1':'value1'}, key2='value2')

dict(iterable, **kwargs)
d = dict([(1,1),(2,2),(3,3)], key='value')


|`len(d)`|Кількість елементів|

|`d[key]`|Отримати значення по ключу `key`. Якщо такого ключа не існує і відображення реалізує спеціальний метод `__missing__(self, key)`, то викликається цей метод. Якщо ключа не існує і метод `__missing__` не визначено — піднімається виняток `KeyError`|


|`d[key] = value`|Змінити значення або створити нову пару ключ-значення, якщо ключа не існує|

|`key in d`, `key not in d`|Перевірка наявності ключа у відображенні|

|`iter(d)`|Те ж саме, щоо `iter(d.keys())`|

|`clear()`|Видалити усі елементи|

|`copy()`|Створити неповну копію|

@classmethod
|`dict.fromkeys(sequence[, value])`|Створити новий словник з ключами з послідовності `sequence` і заданим значенням (за умовчанням – `None`)|
d=dict.fromkeys([3,2,1])
d=dict.fromkeys([3,2,1], 7)



|`d.get(key[, default])`|Безпечно отримати значення по ключу (ніколи не піднімає `KeyError`). Якщо ключа не знайдено, повертає `default` (за умовчанням None)|


|`d.items()`|Повертає об'єкт представлення словника, який відповідає парам ключ-значення|
|`d.keys()`|Повертає об'єкт представлення словника, який відповідає ключам словника|

|`d.pop(key[, default])`|Якщо ключ `key` існує — видаляє елемент зі словника і повертає його значення. Якщо ключа не існує і задане значення `default` — повертає це значення, інакше піднімається виняток `KeyError`|


|`d.popitem()`|Видаляє довільну пару ключ-значення і повертає її. Якщо словник порожній — піднімає виняток `KeyError`|

|`d.setdefault(key[, default])`|Якщо ключ `key` існує — повертає відповідне значення. Інакше створює елемент з ключем `key` і значенням `default` (None за замовчуванням)|

|`d.update(mapping)`|Приймає або інший словник або відображення, або ітерабельний об'єкт, який складається з ітерабельних об'єктів — пар ключ-значення, або іменовані аргументи. Додає відповідні елементи у словник, перезаписуючи елементи з існуючими ключами|

|`d.values()`|Повертає об'єкт представлення який відповідає значенням|






















