'''
"Прості числа"

Просте число - це число, яке ділиться націло тільки на 1 і на себе.
Напишіть функцію is_prime() яка отримує натуральне число.
Функція повертає True, якщо передане їй число є простим, і False в іншому випадку.
Використовуючи написану функцію виведіть у стовпчик перші 7 простих чисел починаючи з числа 2.
Очікуваний вивід:
2
3
5
7
11
13
17
'''
def is_prime(n):
    if n < 2:
        return False
    for i in range(2, int(n**0.5) + 1):
        if n % i == 0:
            return False
    return True

count = 0
number = 2
while count < 7:
    if is_prime(number):
        print(number)
        count += 1
    number += 1
