'''
"Волатильність"

У файлі market-price.csv записано курс Bitcoin у доларах США.
У кожному окремому рядку міститься курс за певну дату.
Дата і курс у рядку розділено знаком коми.
Дата має наступний формат:
- рік (4 цифри)
- знак дефісу
- місяць (2 цифри)
- знак дефісу
- число місяця (2 цифри)

Файл у кодуванні UTF-8.

Напишіть програму яка визначає і виводить:
- найнижчий курс Bitcoin і дату, коли його можна було спостерігати
- найвишчий курс Bitcoin і дату, коли його можна було спостерігати
Курс округлити до цілого.

Приблизно програма має вивести наступне:
Мінімальний курс 2264 був 2017-07-19
Максимальний курс 19498 був 2017-12-16
'''
