'''
"Премія"

Одна фірма виплачує щомісячну премію в залежності від того, 
скільки працівник присвятив часу роботі у даній фірмі.
Принцип нарахування наступний:
- меньше 3 років — премія не нараховується
- 2 роки і більше — 2% від ставки
- 5 років і більше — 4% від ставки
- 10 років і більше — 10% від ставки
Напишіть програму яка виконує наступне:
1. Просить користувача ввести розмір ставки і стаж працівника
2. Виводить нараховану зарплатню — ставка плюс премія
'''
# ваш код починається тут
