result = []
in_file = open('skills.txt', 'r', encoding = 'UTF-8')
for line in in_file:
	data = line.strip().split()
	name = f'{data.pop(2)} {data.pop(0)[0]}.{data.pop(0)[0]}.'
	marks = []
	for m in data:
		marks.append(int(m))
	avg = int(sum(marks) / len(marks) * 100) / 100
	text_line = f'{name},{avg}'
	result.append(text_line)
in_file.close()

result.sort()
out_file = open('skills.csv', 'w', encoding = 'UTF-8')
out_file.write('\n'.join(result))
out_file.close()

''' 
"Школа програмістів"

У текстовому файлі "skills.txt" містяться дані про успішність студентів курсу з програмування.
Файл у кодуванні UTF-8.
У кожному рядку файла записані через пробіл наступні дані про одного студента:
- прізвище
- ім'я
- по батькові
- бали за виконані завдання
Бали - це числа від 1 до 10. Кожен студент виконував різну кількість завдань.

Напишіть програму яка:
- записує у текстовий файл "avg_skills.csv" дані про середній бал кожного студента у такому форматі:
	студент, кома, середній бал.
- середній бал має містити два знаки у дробовій частині
- студента представити як прізвище та через пробіл ініціали з крапкою
Наприклад, якщо у вхідному файлі був рядок:
Петро Олександрович Жук 1 2 3
то у вихідному файлі цей рядок має виглядати так:
Жук П.М.,2.00

Рядки у вихідному файлі мають бути відсортовані у алфавітному порядку.
'''
