1. Різні застосунки можуть використовувати одну і ту ж бібліотеку, 
але при цьому кожному застосунку потрібна бібліотека певної версії.
1. Може виникнути необхідність заборонити вносити зміни в застосунок на рівні бібліотек. 
Тобто ви встановили застосунок і хочете щоб він працював незалежно від того, поновлюються у вас бібліотеки чи ні. 
Як зрозуміло, якщо він буде використовувати бібліотеки з глобального сховища, 
то з часом можуть виникнути проблеми. 
1. У вас просто може не бути доступу до каталогу зі встановленими бібліотеками.

python -m venv .venv

.venv\scripts\activate
deactivate

c:\dev\project\.venv\scripts\python.exe my_app.py

