'''
Напишіть програму яка обчислює площу та довжину периметра прямокутного трикутника по довжині його двох катетів.
Довжину катетів має ввести користувач з клавіатури.
Для отримання значень від користувача використовуйте функцію input() двічі.
Виведіть результати.
'''
# ваш код починається тут
print('Програма обчислює площу та периметр прямокутного трикутника')
cathet1 = float(input('Введіть довжину першого катета: '))
cathet2 = float(input('Введіть довжину другого катета: '))
hypotenuse = (cathet1 ** 2 + cathet2 ** 2) ** (1/2)
perimeter = cathet1 + cathet2 + hypotenuse
square = (cathet1 * cathet2) / 2
print('Периметр:', perimeter)
print('Площа:', square)